/**
 * Данные для отображения района Даунтаун в Дубае
 * 
 * @module maps/data/dubai
 */

module.exports = {
  id: "dubai",
  title: "Район Даунтаун на карте",
  description: "Даунтаун — район в центральной части эмирата Дубай, рассположеный между шоссе Шейха Зайда и Финансовым центром.",
  center: [25.19648794113965, 55.27567249353339],
  zoom: 14,
  // Координаты полигона в формате [lat, lng]
  boundary: [
    [
      55.2739150981877,
      25.202746525143937
    ],
    [
      55.28861602752616,
      25.194953161346007
    ],
    [
      55.28674814473152,
      25.193607269094827
    ],
    [
      55.28425763271622,
      25.192793466557077
    ],
    [
      55.282908606252846,
      25.191666654077267
    ],
    [
      55.27789299504528,
      25.18534379071528
    ],
    [
      55.2687957140285,
      25.191322348185082
    ],
    [
      55.26775800136491,
      25.19413936780215
    ],
    [
      55.267446687565126,
      25.19460886473682
    ],
    [
      55.270110150068774,
      25.19808308580359
    ],
    [
      55.2706290064001,
      25.19902204745584
    ],
    [
      55.271839671220135,
      25.199335032980898
    ],
    [
      55.27405345823567,
      25.202277058374662
    ],
    [
      55.27394968696942,
      25.20268392863177
    ]
  ],
  polygonOptions: {
    color: "#FF0000",      // Красный контур
    weight: 2,             // Толщина линии
    opacity: 0.8,          // Непрозрачность контура
    fillColor: "#FF0000",  // Красное заполнение
    fillOpacity: 0.15      // Прозрачность заполнения
  }
};