/**
 * Данные для отображения района Даунтаун в Дубае
 * 
 * @module maps/data/dubai
 */

module.exports = {
  id: "dubai",
  title: "Район Даунтаун на карте",
  description: "Даунтаун — район в центральной части эмирата Дубай, рассположеный между шоссе Шейха Зайда и Финансовым центром.",
  center: [25.19648794113965, 55.27567249353339],
  zoom: 14,
  // Координаты полигона в формате [lat, lng]
  boundary: [
    [25.202684893501967, 55.27391290320503],
    [25.19480215638947, 55.28850209624758],
    [25.193972359901707, 55.28720983775159],
    [25.193406588968315, 55.28520905989939],
    [25.19250133784371, 55.283708566069265],
    [25.1909171245765, 55.28224968912443],
    [25.18533457787923, 55.27787284881799],
    [25.188767165325658, 55.27287082265488],
    [25.191181187417158, 55.269077636614355],
    [25.192388196315576, 55.26824398870184],
    [25.19389692411214, 55.26795219755061],
    [25.194500409066478, 55.26745201415639],
    [25.197442372636473, 55.2696612070514],
    [25.198875663819862, 55.27032811825606],
    [25.200233423414815, 55.27066160018762],
    [25.202232383908836, 55.27182873721125],
    [25.20268490014297, 55.273829536015114]
  ],
  polygonOptions: {
    color: "#FF0000",      // Красный контур
    weight: 2,             // Толщина линии
    opacity: 0.8,          // Непрозрачность контура
    fillColor: "#FF0000",  // Красное заполнение
    fillOpacity: 0.15      // Прозрачность заполнения
  }
};